### Report for transfer_classifier on environment: dev

#### Terraform Format and Style 🖌`success`
<details><summary>Format Output</summary>

```


```

</details>

#### Terraform Initialization ⚙️`success`
<details><summary>Initialization Output</summary>

```

Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.
Initializing provider plugins...
- Finding hashicorp/aws versions matching "~> 6.0"...
- Installing hashicorp/aws v6.27.0...
- Installed hashicorp/aws v6.27.0 (signed by HashiCorp)
Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

```

</details>

#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan (18 to add, 0 to change, 0 to destroy)</summary>

```


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.transfer_classifier_output_bucket_read_access will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "transfer_classifier_output_bucket_read_access" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + resources = [
              + "arn:aws:s3:::prm-gp2gp-transfer-data-dev",
            ]
          + sid       = "ListBucket"
        }
      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + "arn:aws:s3:::prm-gp2gp-transfer-data-dev/*",
            ]
          + sid       = "ReadObjects"
        }
    }

  # data.aws_iam_policy_document.transfer_classifier_output_buckets_write_access will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "transfer_classifier_output_buckets_write_access" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:PutObject",
            ]
          + resources = [
              + "arn:aws:s3:::prm-gp2gp-notebook-data-dev/*",
              + "arn:aws:s3:::prm-gp2gp-transfer-data-dev/*",
            ]
          + sid       = "WriteObjects"
        }
    }

  # aws_cloudwatch_dashboard.data_pipeline will be created
  + resource "aws_cloudwatch_dashboard" "data_pipeline" {
      + dashboard_arn  = (known after apply)
      + dashboard_body = (sensitive value)
      + dashboard_name = "dev-registrations-data-pipeline-transfer-classifier"
      + id             = (known after apply)
      + region         = "eu-west-2"
    }

  # aws_ecs_task_definition.transfer_classifier will be created
  + resource "aws_ecs_task_definition" "transfer_classifier" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = (sensitive value)
      + cpu                      = "4096"
      + enable_fault_injection   = (known after apply)
      + execution_role_arn       = (sensitive value)
      + family                   = "dev-transfer-classifier"
      + id                       = (known after apply)
      + memory                   = "30720"
      + network_mode             = "awsvpc"
      + region                   = "eu-west-2"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags                     = {
          + "ApplicationRole"     = "AwsEcsTaskDefinition"
          + "BackupLocal"         = "False"
          + "BackupRemote"        = "False"
          + "CostCentre"          = "P0688/04"
          + "CreatedBy"           = "gp2gp-reporting-infrastructure"
          + "Customer"            = "NHS D"
          + "DataType"            = "None"
          + "Environment"         = "dev"
          + "Name"                = "dev-transfer-classifier"
          + "OnOffPattern"        = "AlwaysOn"
          + "Owner"               = "Candice Moore"
          + "Programme"           = "GP IT Futures"
          + "Project"             = "Patient Record Migration"
          + "ProjectType"         = "Public beta"
          + "PublicFacing"        = "N"
          + "ServiceCategory"     = "Bronze"
          + "TagVersion"          = "1"
          + "Team"                = "Registrations"
          + "data_classification" = "1"
          + "envtype"             = "dev"
        }
      + tags_all                 = {
          + "ApplicationRole"     = "AwsEcsTaskDefinition"
          + "BackupLocal"         = "False"
          + "BackupRemote"        = "False"
          + "CostCentre"          = "P0688/04"
          + "CreatedBy"           = "gp2gp-reporting-infrastructure"
          + "Customer"            = "NHS D"
          + "DataType"            = "None"
          + "Environment"         = "dev"
          + "Name"                = "dev-transfer-classifier"
          + "OnOffPattern"        = "AlwaysOn"
          + "Owner"               = "Candice Moore"
          + "Programme"           = "GP IT Futures"
          + "Project"             = "Patient Record Migration"
          + "ProjectType"         = "Public beta"
          + "PublicFacing"        = "N"
          + "ServiceCategory"     = "Bronze"
          + "TagVersion"          = "1"
          + "Team"                = "Registrations"
          + "data_classification" = "1"
          + "envtype"             = "dev"
        }
      + task_role_arn            = (known after apply)
      + track_latest             = false
    }

  # aws_iam_policy.spine_messages_bucket_read_access will be created
  + resource "aws_iam_policy" "spine_messages_bucket_read_access" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = (sensitive value)
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "s3:ListBucket"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::prm-gp2gp-raw-spine-data-dev"
                      + Sid      = "ListBucket"
                    },
                  + {
                      + Action   = "s3:GetObject"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::prm-gp2gp-raw-spine-data-dev/*"
                      + Sid      = "ReadObjects"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # aws_iam_policy.transfer_classifier_output_bucket_read_access will be created
  + resource "aws_iam_policy" "transfer_classifier_output_bucket_read_access" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Transfer Classifier S3 bucket read access needed for metrics calculator and reports generator"
      + id               = (known after apply)
      + name             = "prm-gp2gp-transfer-data-dev-read"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # aws_iam_policy.transfer_classifier_output_buckets_write_access will be created
  + resource "aws_iam_policy" "transfer_classifier_output_buckets_write_access" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "transfer-classifier-output-buckets-dev-write"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # aws_iam_role.transfer_classifier will be created
  + resource "aws_iam_role" "transfer_classifier" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "Role for transfer classifier ECS task"
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "dev-registrations-transfer-classifier"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role_policy_attachment.transfer_classifier_ods_metadata_bucket_read_access will be created
  + resource "aws_iam_role_policy_attachment" "transfer_classifier_ods_metadata_bucket_read_access" {
      + id         = (known after apply)
      + policy_arn = (sensitive value)
      + role       = "dev-registrations-transfer-classifier"
    }

  # aws_iam_role_policy_attachment.transfer_classifier_output_buckets_write_access will be created
  + resource "aws_iam_role_policy_attachment" "transfer_classifier_output_buckets_write_access" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "dev-registrations-transfer-classifier"
    }

  # aws_iam_role_policy_attachment.transfer_classifier_spine_messages_bucket_read_access will be created
  + resource "aws_iam_role_policy_attachment" "transfer_classifier_spine_messages_bucket_read_access" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "dev-registrations-transfer-classifier"
    }

  # aws_s3_bucket.transfer_classifier will be created
  + resource "aws_s3_bucket" "transfer_classifier" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "prm-gp2gp-transfer-data-dev"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_region               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = "eu-west-2"
      + request_payer               = (known after apply)
      + tags                        = {
          + "ApplicationRole"     = "AwsS3Bucket"
          + "BackupLocal"         = "False"
          + "BackupRemote"        = "False"
          + "CostCentre"          = "P0688/04"
          + "CreatedBy"           = "gp2gp-reporting-infrastructure"
          + "Customer"            = "NHS D"
          + "DataType"            = "None"
          + "Environment"         = "dev"
          + "Name"                = "dev-output-transfer-data-for-metrics-calculator-and-data-analysis"
          + "OnOffPattern"        = "AlwaysOn"
          + "Owner"               = "Candice Moore"
          + "Programme"           = "GP IT Futures"
          + "Project"             = "Patient Record Migration"
          + "ProjectType"         = "Public beta"
          + "PublicFacing"        = "N"
          + "ServiceCategory"     = "Bronze"
          + "TagVersion"          = "1"
          + "Team"                = "Registrations"
          + "data_classification" = "1"
          + "envtype"             = "dev"
        }
      + tags_all                    = {
          + "ApplicationRole"     = "AwsS3Bucket"
          + "BackupLocal"         = "False"
          + "BackupRemote"        = "False"
          + "CostCentre"          = "P0688/04"
          + "CreatedBy"           = "gp2gp-reporting-infrastructure"
          + "Customer"            = "NHS D"
          + "DataType"            = "None"
          + "Environment"         = "dev"
          + "Name"                = "dev-output-transfer-data-for-metrics-calculator-and-data-analysis"
          + "OnOffPattern"        = "AlwaysOn"
          + "Owner"               = "Candice Moore"
          + "Programme"           = "GP IT Futures"
          + "Project"             = "Patient Record Migration"
          + "ProjectType"         = "Public beta"
          + "PublicFacing"        = "N"
          + "ServiceCategory"     = "Bronze"
          + "TagVersion"          = "1"
          + "Team"                = "Registrations"
          + "data_classification" = "1"
          + "envtype"             = "dev"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # aws_s3_bucket_acl.transfer_classifier will be created
  + resource "aws_s3_bucket_acl" "transfer_classifier" {
      + acl    = "private"
      + bucket = (known after apply)
      + id     = (known after apply)
      + region = "eu-west-2"

      + access_control_policy (known after apply)
    }

  # aws_s3_bucket_ownership_controls.transfer_classifier will be created
  + resource "aws_s3_bucket_ownership_controls" "transfer_classifier" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + region = "eu-west-2"

      + rule {
          + object_ownership = "ObjectWriter"
        }
    }

  # aws_s3_bucket_public_access_block.transfer_classifier will be created
  + resource "aws_s3_bucket_public_access_block" "transfer_classifier" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + region                  = "eu-west-2"
      + restrict_public_buckets = true
    }

  # aws_s3_bucket_versioning.transfer_classifier will be created
  + resource "aws_s3_bucket_versioning" "transfer_classifier" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + region = "eu-west-2"

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

  # aws_ssm_parameter.transfer_classifier_iam_role_arn will be created
  + resource "aws_ssm_parameter" "transfer_classifier_iam_role_arn" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/registrations/dev/data-pipeline/transfer-classifier/iam-role-arn"
      + region         = "eu-west-2"
      + tags           = {
          + "ApplicationRole"     = "AwsSsmParameter"
          + "BackupLocal"         = "False"
          + "BackupRemote"        = "False"
          + "CostCentre"          = "P0688/04"
          + "CreatedBy"           = "gp2gp-reporting-infrastructure"
          + "Customer"            = "NHS D"
          + "DataType"            = "None"
          + "Environment"         = "dev"
          + "Name"                = "dev-transfer-classifier-iam-role"
          + "OnOffPattern"        = "AlwaysOn"
          + "Owner"               = "Candice Moore"
          + "Programme"           = "GP IT Futures"
          + "Project"             = "Patient Record Migration"
          + "ProjectType"         = "Public beta"
          + "PublicFacing"        = "N"
          + "ServiceCategory"     = "Bronze"
          + "TagVersion"          = "1"
          + "Team"                = "Registrations"
          + "data_classification" = "1"
          + "envtype"             = "dev"
        }
      + tags_all       = {
          + "ApplicationRole"     = "AwsSsmParameter"
          + "BackupLocal"         = "False"
          + "BackupRemote"        = "False"
          + "CostCentre"          = "P0688/04"
          + "CreatedBy"           = "gp2gp-reporting-infrastructure"
          + "Customer"            = "NHS D"
          + "DataType"            = "None"
          + "Environment"         = "dev"
          + "Name"                = "dev-transfer-classifier-iam-role"
          + "OnOffPattern"        = "AlwaysOn"
          + "Owner"               = "Candice Moore"
          + "Programme"           = "GP IT Futures"
          + "Project"             = "Patient Record Migration"
          + "ProjectType"         = "Public beta"
          + "PublicFacing"        = "N"
          + "ServiceCategory"     = "Bronze"
          + "TagVersion"          = "1"
          + "Team"                = "Registrations"
          + "data_classification" = "1"
          + "envtype"             = "dev"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + value_wo       = (write-only attribute)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.transfer_classifier_output_bucket_name will be created
  + resource "aws_ssm_parameter" "transfer_classifier_output_bucket_name" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/registrations/dev/data-pipeline/transfer-classifier/output-bucket-name"
      + region         = "eu-west-2"
      + tags           = {
          + "ApplicationRole"     = "AwsSsmParameter"
          + "BackupLocal"         = "False"
          + "BackupRemote"        = "False"
          + "CostCentre"          = "P0688/04"
          + "CreatedBy"           = "gp2gp-reporting-infrastructure"
          + "Customer"            = "NHS D"
          + "DataType"            = "None"
          + "Environment"         = "dev"
          + "Name"                = "dev-transfer-classifier-output-bucket-name"
          + "OnOffPattern"        = "AlwaysOn"
          + "Owner"               = "Candice Moore"
          + "Programme"           = "GP IT Futures"
          + "Project"             = "Patient Record Migration"
          + "ProjectType"         = "Public beta"
          + "PublicFacing"        = "N"
          + "ServiceCategory"     = "Bronze"
          + "TagVersion"          = "1"
          + "Team"                = "Registrations"
          + "data_classification" = "1"
          + "envtype"             = "dev"
        }
      + tags_all       = {
          + "ApplicationRole"     = "AwsSsmParameter"
          + "BackupLocal"         = "False"
          + "BackupRemote"        = "False"
          + "CostCentre"          = "P0688/04"
          + "CreatedBy"           = "gp2gp-reporting-infrastructure"
          + "Customer"            = "NHS D"
          + "DataType"            = "None"
          + "Environment"         = "dev"
          + "Name"                = "dev-transfer-classifier-output-bucket-name"
          + "OnOffPattern"        = "AlwaysOn"
          + "Owner"               = "Candice Moore"
          + "Programme"           = "GP IT Futures"
          + "Project"             = "Patient Record Migration"
          + "ProjectType"         = "Public beta"
          + "PublicFacing"        = "N"
          + "ServiceCategory"     = "Bronze"
          + "TagVersion"          = "1"
          + "Team"                = "Registrations"
          + "data_classification" = "1"
          + "envtype"             = "dev"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + value_wo       = (write-only attribute)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.transfer_classifier_output_bucket_read_access_arn will be created
  + resource "aws_ssm_parameter" "transfer_classifier_output_bucket_read_access_arn" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/registrations/dev/data-pipeline/transfer-classifier/output-bucket-read-access-arn"
      + region         = "eu-west-2"
      + tags           = {
          + "ApplicationRole"     = "AwsSsmParameter"
          + "BackupLocal"         = "False"
          + "BackupRemote"        = "False"
          + "CostCentre"          = "P0688/04"
          + "CreatedBy"           = "gp2gp-reporting-infrastructure"
          + "Customer"            = "NHS D"
          + "DataType"            = "None"
          + "Environment"         = "dev"
          + "Name"                = "dev-transfer-classifier-output-bucket-read-access-arn"
          + "OnOffPattern"        = "AlwaysOn"
          + "Owner"               = "Candice Moore"
          + "Programme"           = "GP IT Futures"
          + "Project"             = "Patient Record Migration"
          + "ProjectType"         = "Public beta"
          + "PublicFacing"        = "N"
          + "ServiceCategory"     = "Bronze"
          + "TagVersion"          = "1"
          + "Team"                = "Registrations"
          + "data_classification" = "1"
          + "envtype"             = "dev"
        }
      + tags_all       = {
          + "ApplicationRole"     = "AwsSsmParameter"
          + "BackupLocal"         = "False"
          + "BackupRemote"        = "False"
          + "CostCentre"          = "P0688/04"
          + "CreatedBy"           = "gp2gp-reporting-infrastructure"
          + "Customer"            = "NHS D"
          + "DataType"            = "None"
          + "Environment"         = "dev"
          + "Name"                = "dev-transfer-classifier-output-bucket-read-access-arn"
          + "OnOffPattern"        = "AlwaysOn"
          + "Owner"               = "Candice Moore"
          + "Programme"           = "GP IT Futures"
          + "Project"             = "Patient Record Migration"
          + "ProjectType"         = "Public beta"
          + "PublicFacing"        = "N"
          + "ServiceCategory"     = "Bronze"
          + "TagVersion"          = "1"
          + "Team"                = "Registrations"
          + "data_classification" = "1"
          + "envtype"             = "dev"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + value_wo       = (write-only attribute)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.transfer_classifier_task_definition_arn will be created
  + resource "aws_ssm_parameter" "transfer_classifier_task_definition_arn" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/registrations/dev/data-pipeline/transfer-classifier/task-definition-arn"
      + region         = "eu-west-2"
      + tags           = {
          + "ApplicationRole"     = "AwsSsmParameter"
          + "BackupLocal"         = "False"
          + "BackupRemote"        = "False"
          + "CostCentre"          = "P0688/04"
          + "CreatedBy"           = "gp2gp-reporting-infrastructure"
          + "Customer"            = "NHS D"
          + "DataType"            = "None"
          + "Environment"         = "dev"
          + "Name"                = "dev-transfer-classifier-task-definition-arn"
          + "OnOffPattern"        = "AlwaysOn"
          + "Owner"               = "Candice Moore"
          + "Programme"           = "GP IT Futures"
          + "Project"             = "Patient Record Migration"
          + "ProjectType"         = "Public beta"
          + "PublicFacing"        = "N"
          + "ServiceCategory"     = "Bronze"
          + "TagVersion"          = "1"
          + "Team"                = "Registrations"
          + "data_classification" = "1"
          + "envtype"             = "dev"
        }
      + tags_all       = {
          + "ApplicationRole"     = "AwsSsmParameter"
          + "BackupLocal"         = "False"
          + "BackupRemote"        = "False"
          + "CostCentre"          = "P0688/04"
          + "CreatedBy"           = "gp2gp-reporting-infrastructure"
          + "Customer"            = "NHS D"
          + "DataType"            = "None"
          + "Environment"         = "dev"
          + "Name"                = "dev-transfer-classifier-task-definition-arn"
          + "OnOffPattern"        = "AlwaysOn"
          + "Owner"               = "Candice Moore"
          + "Programme"           = "GP IT Futures"
          + "Project"             = "Patient Record Migration"
          + "ProjectType"         = "Public beta"
          + "PublicFacing"        = "N"
          + "ServiceCategory"     = "Bronze"
          + "TagVersion"          = "1"
          + "Team"                = "Registrations"
          + "data_classification" = "1"
          + "envtype"             = "dev"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + value_wo       = (write-only attribute)
      + version        = (known after apply)
    }

Plan: 18 to add, 0 to change, 0 to destroy.

```

</details>